tmp/dependency_graphs/taskManager_graph.mmd
flowchart TD
  taskManager --> licensing
  taskManager -.-> cloud
  taskManager -.-> usageCollection
  workflowsExecutionEngine --> taskManager
  workflowsManagement --> taskManager
  actions --> taskManager
  productDocBase --> taskManager
  alerting --> taskManager
  automaticImportVTwo --> taskManager
  contentConnectors --> taskManager
  fleet --> taskManager
  maintenanceWindows --> taskManager
  ml --> taskManager
  observabilityAIAssistant --> taskManager
  osquery --> taskManager
  sampleDataIngest --> taskManager
  security --> taskManager
  streams --> taskManager
  indicesMetadata --> taskManager
  reporting --> taskManager
  taskManagerDependencies --> taskManager
  slo --> taskManager
  synthetics --> taskManager
  uptime --> taskManager
  cloudSecurityPosture --> taskManager
  elasticAssistant --> taskManager
  entityStore --> taskManager
  securitySolution --> taskManager
  securitySolutionServerless --> taskManager
